TITANIC SURVIVOR ANALYSIS

In [47]:
import pandas as pd
import numpy as np

Reading data using pandas

In [48]:
df = pd.DataFrame(pd.read_csv("train.csv"))
df.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

**Description of the attributes of the dataset:**


Pclass: Passenger Class (1 = 1st, 2 = 2nd, 3 = 3rd)

Survival: Survival (0 = NO, 1 = YES)

Name: Name

Sex: Sex

Age: Age

Ticket: Ticket Number

Fare: Passengers Fare (In British Pound)

Cabin: Cabin

Embarked: Port of Embarkation (C = Cherboug, Q = Queenstown, S = Southampton)

SibSp: Number of Siblings/Spouses Aboard

Parch: Number of Parents/Children Aboard

Size of the dataset

In [49]:
df.shape

(891, 12)

Handeling the Null values

In [50]:
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

Seperating out the columns which have mor than 35% of the missing values in the dataset.

In [51]:
drop_col = df.isnull().sum()[df.isnull().sum()>(35/100 * df.shape[0])]
drop_col

Cabin    687
dtype: int64

In [52]:
drop_col.index

Index(['Cabin'], dtype='object')

In [53]:
df.drop(drop_col.index,axis=1,inplace=True)
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Embarked         2
dtype: int64

In [54]:
df.fillna(df.mean(),inplace=True)
df.isnull().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Embarked       2
dtype: int64

Beacuse, Embarked contains the string values. We can see that the details of the column seperately from others as strings does not have mean.

In [56]:
df["Embarked"].describe()

count     889
unique      3
top         S
freq      644
Name: Embarked, dtype: object

For Embarked attribute, i will fill with the NULL values which are most frequent value in the column.

In [57]:
df["Embarked"].fillna('s',inplace=True)

In [58]:
df.isnull().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Embarked       0
dtype: int64

In [59]:
df.corr()

             PassengerId  Survived    Pclass  ...     SibSp     Parch      Fare
PassengerId     1.000000 -0.005007 -0.035144  ... -0.057527 -0.001652  0.012658
Survived       -0.005007  1.000000 -0.338481  ... -0.035322  0.081629  0.257307
Pclass         -0.035144 -0.338481  1.000000  ...  0.083081  0.018443 -0.549500
Age             0.033207 -0.069809 -0.331339  ... -0.232625 -0.179191  0.091566
SibSp          -0.057527 -0.035322  0.083081  ...  1.000000  0.414838  0.159651
Parch          -0.001652  0.081629  0.018443  ...  0.414838  1.000000  0.216225
Fare            0.012658  0.257307 -0.549500  ...  0.159651  0.216225  1.000000

[7 rows x 7 columns]

SibSp: Number of Siblings/Spouses Aboard.

Parch: Number of Parents/Children Aboard.

So, now i will create a new column "Family_Size" by combining the "SibSp" and "Parch" columns.

In [60]:
df['FamilySize'] = df['SibSp']+df['Parch']
df.drop(['SibSp', 'Parch'],axis=1, inplace=True)
df.corr()

             PassengerId  Survived    Pclass       Age      Fare  FamilySize
PassengerId     1.000000 -0.005007 -0.035144  0.033207  0.012658   -0.040143
Survived       -0.005007  1.000000 -0.338481 -0.069809  0.257307    0.016639
Pclass         -0.035144 -0.338481  1.000000 -0.331339 -0.549500    0.065997
Age             0.033207 -0.069809 -0.331339  1.000000  0.091566   -0.248512
Fare            0.012658  0.257307 -0.549500  0.091566  1.000000    0.217138
FamilySize     -0.040143  0.016639  0.065997 -0.248512  0.217138    1.000000

Family size in the ship does not have much correlation with the survivial rate.

Now i will check wheather the person was alone or not can affect the survivial rate.

In [62]:
df['Alone'] = [0 if df['FamilySize'][i]>0 else 1 for i in df.index]
df.head()

   PassengerId  Survived  Pclass  ... Embarked FamilySize  Alone
0            1         0       3  ...        S          1      0
1            2         1       1  ...        C          1      0
2            3         1       3  ...        S          0      1
3            4         1       1  ...        S          1      0
4            5         0       3  ...        S          0      1

[5 rows x 11 columns]

In [64]:
df.groupby(['Alone'])['Survived'].mean()

Alone
0    0.505650
1    0.303538
Name: Survived, dtype: float64

If the person she/he is alone has the less chance of surviving. As they might be the person who is travelling with his family might be belonging to the high class / rich class and might be prioritized over the other passengers.

In [65]:
df[['Alone','Fare']].corr()

          Alone      Fare
Alone  1.000000 -0.271832
Fare  -0.271832  1.000000

We can say that if the person was not alone, the chance of the ticket price is higher is also high.

In [66]:
#1 for female
#0 for male
df['Sex'] = [0 if df['Sex'][i]=='male' else 1 for i in df.index] 
df.groupby(['Sex'])['Survived'].mean()

Sex
0    0.188908
1    0.742038
Name: Survived, dtype: float64

It Shows that female passengers have more chances of surviving than men.

It shows that women were more prioritized over men.

In [67]:
df.groupby(['Embarked'])['Survived'].mean()

Embarked
C    0.553571
Q    0.389610
S    0.336957
s    1.000000
Name: Survived, dtype: float64

CONCLUSION

⚝ Female passengers were prioritized over men.

⚝ Passengers travelling with there family's have the higher survival rate.

⚝ Passengers who borded the ship at Cherbourg, survival more in proportion than the other passengers.

⚝ Rich people or high class people have higher survival rate than other passengers. The hierarichy might have been followed while saving the passengers.